In [4]:
class Foo: 
    def __init__(self, bar): 
        self.bar = bar
    
    def __repr__(self):
        #Foo("bar")
        return f"""Foo({self.bar!r})"""

In [6]:
f = Foo("Hello")
g = Foo("Grandma's house")
h = Foo(r"C:\ drive")

In [12]:
print(f)
print(repr(f))
print(f"{f!r}")

Foo('Hello')
Foo('Hello')
Foo('Hello')

In [11]:
print(g)

Foo("Grandma's house")

In [13]:
print(h)

Foo('C:\\ drive')

In [15]:
import pandas as pd

In [16]:
df_athletes = pd.read_csv("speed_skaters.csv")
df_athletes.head()

                    Name  Birth year  Height  Weight
0  Aerchenghazi XIAKAINI        1995    1.85      83
1      Aleksandr LEBEDEV        1987    1.78      70
2       Aleksandr ZHIGIN        1986    1.80      80
3        Aleksey SUVOROV        1991    1.80      80
4          Aleksey YESIN        1987    1.78      85

In [17]:
filenames = ["mens1500_2006.csv", "mens1500_2010.csv", "mens1500_2014.csv", "mens1500_2018.csv"]
result_list = [pd.read_csv(fname) for fname in filenames]
df_results = pd.concat(result_list)

In [18]:
df_results = pd.concat(
    [pd.read_csv(fn) for fn in ["mens1500_2006.csv", "mens1500_2010.csv", "mens1500_2014.csv", "mens1500_2018.csv"]]
)

In [19]:
df_results.head()

   Rank          Athlete Country    Result  Finished  Year
0   1.0    Enrico FABRIS     ITA  01:45.97         1  2006
1   2.0      Shani DAVIS     USA  01:46.13         1  2006
2   3.0     Chad HEDRICK     USA  01:46.22         1  2006
3   4.0    Simon KUIPERS     NED  01:46.58         1  2006
4   5.0  Erben WENNEMARS     NED  01:46.71         1  2006

In [25]:
df = pd.merge(df_athletes, df_results, 
              left_on="Name", right_on="Athlete", 
              how="inner").drop("Name", axis =1)

In [26]:
df.head()

,Birth year,Height,Weight,Rank,Athlete,Country,Result,Finished,Year
0,1995,1.85,83,32.0,Aerchenghazi XIAKAINI,CHN,01:50.16,1,2018
1,1987,1.78,70,36.0,Aleksandr LEBEDEV,RUS,01:52.09,1,2010
2,1986,1.80,80,34.0,Aleksandr ZHIGIN,KAZ,01:49.48,1,2014
3,1991,1.80,80,25.0,Aleksey SUVOROV,RUS,01:48.11,1,2014
4,1987,1.78,85,21.0,Aleksey YESIN,RUS,01:48.65,1,2010

In [28]:
df[(df["Rank"] > 20) & (df["Country"] == "USA")]

,Birth year,Height,Weight,Rank,Athlete,Country,Result,Finished,Year
71,1990,1.83,79,37.0,Jonathan KUCK,USA,01:50.19,1,2014
84,1986,1.73,78,22.0,Joey MANTIA,USA,01:48.01,1,2014

In [31]:
df.groupby("Country")["Height"].mean()

Country
BEL    1.800000
CAN    1.823333
CHN    1.845000
EST    1.820000
FIN    1.880000
FRA    1.807500
GER    1.832857
HUN    1.880000
ITA    1.834444
JPN    1.746000
KAZ    1.828750
KOR    1.783333
LAT    1.780000
NED    1.841333
NOR    1.834667
NZL    1.790000
OAR    1.840000
POL    1.810000
RUS    1.836667
SUI    1.750000
SWE    1.842000
TPE    1.740000
USA    1.799333
Name: Height, dtype: float64

In [35]:
df.groupby("Country")["Height"].median().sort_values()

Country
TPE    1.740
SUI    1.750
JPN    1.755
BEL    1.780
LAT    1.780
KOR    1.780
NZL    1.790
POL    1.800
NOR    1.820
EST    1.820
CHN    1.825
FRA    1.825
SWE    1.830
CAN    1.830
GER    1.830
USA    1.830
KAZ    1.835
OAR    1.840
NED    1.840
RUS    1.850
ITA    1.850
FIN    1.880
HUN    1.880
Name: Height, dtype: float64

In [37]:
df.groupby("Year")["Weight"].min()

Year
2006    64
2010    70
2014    67
2018    65
Name: Weight, dtype: int64